/****************************************************************************
* 文 件 名: time.c
* 作    者: Qiao Yu
* 修    订: 2019-01-28
* 版    本: 1.0
* 描    述: 
****************************************************************************/

#include <time.h>


/****************************************************************************
* 名    称: DelayUS()
* 功    能: 以微秒为单位延时(32M时钟)
* 入口参数: usec 延时参数，值越大，延时越久
* 出口参数: 无
****************************************************************************/
void DelayUS(uint usec)
{ 
    uint i,j;
    
    for (i=0; i<usec; i++)
        for (j=0; j<1; j++);
}

/****************************************************************************
* 名    称: DelayMS()
* 功    能: 以毫秒为单位延时(32M时钟)
* 入口参数: msec 延时参数，值越大，延时越久
* 出口参数: 无
****************************************************************************/
void DelayMS(uint msec)
{ 
    uint i,j;
    
    for (i=0; i<msec; i++)
        for (j=0; j<1070; j++);
}
void InitTime(void)
{
    CLKCONCMD &= ~0x40;                        //设置系统时钟源为32MHZ晶振
    while(CLKCONSTA & 0x40);                   //等待晶振稳定为32M
    CLKCONCMD &= ~0x47;                        //设置系统主时钟频率为32MHZ  
}
